index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-28 Sun 12:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Marco Craveiro's Home Page</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Marco Craveiro's Home Page</h1>

<div id="outline-container-org4f080e1" class="outline-2">
<h2 id="org4f080e1">Introduction</h2>
<div class="outline-text-2" id="text-org4f080e1">
<p>
Welcome to my website. Over the years I've accumulated quite a large
amount of assorted content, in various different platforms, and begun
to lose track of it. In order to bring some kind of order to the
chaos, I decided to republish all of this material under a single
home, using the tools I love - <i>e.g.</i>, <a href="https://www.gnu.org/software/emacs/">emacs</a>, <a href="https://orgmode.org/">org-mode</a>, <a href="https://git-scm.com/">git</a> and the
like. I'm not entirely sure you will find anything particularly
amazing around here, but have a browse. If you need to know more about
me, see the <a href="about.html">about page</a>.
</p>
</div>
</div>

<div id="outline-container-orgf54946e" class="outline-2">
<h2 id="orgf54946e">Content</h2>
<div class="outline-text-2" id="text-orgf54946e">
<p>
The site is organised rather like a wiki, instead of having the more
traditional "blog posts" feel. Some of the stuff is very old and was
originally published in <a href="https://mcraveiro.blogspot.com/">my blog in blogger</a> - though these days I very
much prefer writing and publishing directly in org-mode, and thus my
blog has died a slow death. My main topics of interest are - in no
particular order of importance - Angola, Finance, Programming,
Computational Neuroscience, Football. There may be other topics here
too.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="dogen/dogen.html">Dogen</a></td>
<td class="org-left">Dogen is a code-generator I am developing as part of my PhD thesis.</td>
</tr>

<tr>
<td class="org-left"><a href="devsites.html">Developer sites</a></td>
<td class="org-left">I occasionally create questions and answers in developer sites.</td>
</tr>

<tr>
<td class="org-left"><a href="bookmarks.html">Interesting</a></td>
<td class="org-left">Assorted bookmarks on stuff I bump into.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfe176d5" class="outline-2">
<h2 id="orgfe176d5">Site Tooling</h2>
<div class="outline-text-2" id="text-orgfe176d5">
<p>
The site is kept intentionally very simple - just a set of org-mode
files, exported to HTML using the amazing
<a href="https://github.com/dakrone/ox-tufte">ox-tufte</a> <label for="1" class="margin-toggle sidenote-number"></label><input type="checkbox" id="1" class="margin-toggle"/><span class="sidenote">
Do see the equally amazing <a href="https://github.com/marsmining/ox-twbs">ox-twbs</a>.
</span> <label for="2" class="margin-toggle sidenote-number"></label><input type="checkbox" id="2" class="margin-toggle"/><span class="sidenote">
For the CSS see the <a href="https://github.com/edwardtufte/tufte-css">tufte-css</a> GitHub project.
</span>. The process of converting the
org-mode files into HTML is <i>extraordinarily manual</i> - I open a file
and export using <code>org-tufte-export-to-html</code> or the org-mode export
menu. I would very much advise <i>against</i> copying this approach, and
I've only chosen it because I lack the time to move to a more sensible
framework.
</p>
</div>
</div>
<div id="outline-container-orge9e0533" class="outline-2">
<h2 id="orge9e0533">Social Media</h2>
<div class="outline-text-2" id="text-orge9e0533">
<p>
You may find me in several social media platforms, though I am not the
most prolific of posters. Also, this site does not support user
commentary, so if for whatever reason you feel the need to reach out,
your best bet is to find me on Twitter.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Platform</th>
<th scope="col" class="org-left">Profile</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Micro-blogging</td>
<td class="org-left"><a href="https://twitter.com/MarcoCraveiro">Twitter</a>, <a href="https://www.instagram.com/marco_craveiro/">Instagram</a></td>
</tr>

<tr>
<td class="org-left">Development</td>
<td class="org-left"><a href="https://github.com/mcraveiro">GitHub</a>, <a href="https://gitlab.com/mcraveiro">GitLab</a></td>
</tr>

<tr>
<td class="org-left">Other</td>
<td class="org-left"><a href="https://www.linkedin.com/in/marco-craveiro-31558919/">LinkedIn</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Do see the equally amazing <a href="https://github.com/marsmining/ox-twbs">ox-twbs</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
For the CSS see the <a href="https://github.com/edwardtufte/tufte-css">tufte-css</a> GitHub project.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Created: 2021-02-28 Sun 12:00</p>
</div>
</body>
</html>
